Examinator/src/DataProcessors/УчебныеЗаданияСУЗ/УчебныеЗаданияСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УчебныеЗаданияСУЗ</name>
</mdclass:DataProcessor>

Examinator/src/InformationRegisters/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПрохожденияВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистратора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/СпособыПодключенияКВнешнейИнформационнойБазеСУЗ/СпособыПодключенияКВнешнейИнформационнойБазеСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПодключенияКВнешнейИнформационнойБазеСУЗ</name>
  <enumValues>
    <name>Сервер</name>
  </enumValues>
  <enumValues>
    <name>Файл</name>
  </enumValues>
  <enumValues>
    <name>ВебСервер</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/DataProcessors/УчебныеЗаданияСУЗ/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет проверку действий пользователя в программе.
//
// Параметры:
//  Этапы  - Таблица. Этапы выполнения задания.
//  Параметры - Таблица. Параметры выполнения задания.
//
Процедура ПроверитьЗадание(Этапы, Параметры, НастройкиПодключения) Экспорт
	
	// Завершаем активный этап.
	// Если не удалось, ничего не делаем.
	// Если удалось, делаем активным следующий этап
	// Если нет активных этапов, делаем активным первый.
	
	Для каждого ЭтапДанные Из Этапы Цикл
		
		Если ЭтапДанные.Активный Тогда
			
			Если ЭтапДанные.Завершен Тогда
				
				Продолжить; // Обрабатываем следующий этап
				
			Иначе
					
				// Пытаемся завершить активный этап
				
				ЗавершитьЭтап(ЭтапДанные, Параметры, НастройкиПодключения);
				
				Если ЭтапДанные.Завершен Тогда
					Продолжить; // Успешно завершили, переходим к следующему этапу
				Иначе
					Прервать; // Ничего не делаем, так как не удалось завершить этап
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
				
			// Активизируем неактивный этап
			
			АктивизироватьЭтап(ЭтапДанные, Параметры, НастройкиПодключения);
			
			Прервать; // Активизируем только первый этап
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура АктивизироватьЭтап(ДанныеЭтапа, Параметры, НастройкиПодключения)
	
	Если ДанныеЭтапа.Активный Тогда
		Возврат;
	КонецЕсли;
	
	// Запоминаем начальные данные этапа каждого типа
	
	Если ДанныеЭтапа.Код = "СоздатьВопрос" Тогда
		ДанныеЭтапа.НачальныеДанные = КоличествоЭлементовСправочника("ВопросыСУЗ");
		ДанныеЭтапа.КодКомментария = "КоличествоВопросовВБазе";
		УстановитьЗначениеПараметра(Параметры, "НачальноеКоличествоВопросов", ДанныеЭтапа.НачальныеДанные);
		УстановитьПризнакАктивностиЭтапа(ДанныеЭтапа, НастройкиПодключения);
	КонецЕсли;	
	
	Если ДанныеЭтапа.Код = "СоздатьТест" Тогда
		ДанныеЭтапа.НачальныеДанные = КоличествоЭлементовСправочника("ПодборкиСУЗ", Новый Структура("ЭтоТест", Истина));
		ДанныеЭтапа.КодКомментария = "КоличествоТестовВБазе";
		УстановитьЗначениеПараметра(Параметры, "НачальноеКоличествоТестов", ДанныеЭтапа.НачальныеДанные);
		УстановитьПризнакАктивностиЭтапа(ДанныеЭтапа, НастройкиПодключения);
	КонецЕсли;	
	
	Если ДанныеЭтапа.Код = "ОпределитьКоличествоПросмотровЭлектронногоРесурса"
		ИЛИ ДанныеЭтапа.Код = "ОпределитьДеньНаибольшейАктивностиВКурсеЗаЭтотГод" Тогда
		
		ИдентификаторЭлектронногоРесурса = ЗначениеПараметра(Параметры, "ИдентификаторЭлектронногоРесурса");
		
		Если НЕ ЗначениеЗаполнено(ИдентификаторЭлектронногоРесурса) Тогда
			
			СлучайныйКурсДанные = СлучайныйЭлементСправочника("СводыЗнанийСУЗ", Новый Структура("Тип", Перечисления.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс));
			
			УстановитьЗначениеПараметра(Параметры, "ИмяЭлектронногоРесурса", СлучайныйКурсДанные.Наименование);
			УстановитьЗначениеПараметра(Параметры, "ИдентификаторЭлектронногоРесурса", Строка(СлучайныйКурсДанные.Ссылка.УникальныйИдентификатор()));
			
		Иначе
			
			СлучайныйКурсДанные = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(Новый уникальныйИдентификатор(ИдентификаторЭлектронногоРесурса));
			
		КонецЕсли;
				
		ДатаПросмотраЭлектронногоРесурса = ЗначениеПараметра(Параметры, "ДатаПросмотраЭлектронногоРесурса");
		
		Если НЕ ЗначениеЗаполнено(ДатаПросмотраЭлектронногоРесурса) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Период КАК Период,
				|	1 КАК Попытка
				|ИЗ
				|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
				|ГДЕ
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс
				|
				|УПОРЯДОЧИТЬ ПО
				|	Период";
			
			Запрос.УстановитьПараметр("ЭлектронныйРесурс", СлучайныйКурсДанные.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ТаблицаПопыток = РезультатЗапроса.Выгрузить();
			
			Для каждого Строка Из ТаблицаПопыток Цикл
				Строка.Период = НачалоДня(Строка.Период);
			КонецЦикла;
			
			ТаблицаПопыток.Свернуть("Период", "Попытка");
			
			ТаблицаПопыток.Сортировать("Попытка Убыв");
			
			Если ТаблицаПопыток.Количество() > 0 Тогда
				УстановитьЗначениеПараметра(Параметры, "ДатаПросмотраЭлектронногоРесурса", ТаблицаПопыток[0].Период);
			Иначе
				УстановитьЗначениеПараметра(Параметры, "ДатаПросмотраЭлектронногоРесурса", Дата("00010101"));
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДанныеЭтапа.Код = "ОпределитьКоличествоПросмотровЭлектронногоРесурса" Тогда
			ДанныеЭтапа.НачальныеДанные = Строка(СлучайныйКурсДанные.Ссылка.УникальныйИдентификатор());
		КонецЕсли;
		
		Если ДанныеЭтапа.Код = "ОпределитьДеньНаибольшейАктивностиВКурсеЗаЭтотГод" Тогда
			ДанныеЭтапа.НачальныеДанные = Формат(ДатаПросмотраЭлектронногоРесурса, "ДЛФ=D");
		КонецЕсли;
		
		УстановитьПризнакАктивностиЭтапа(ДанныеЭтапа, НастройкиПодключения);
		
	КонецЕсли;	
	
	Если ДанныеЭтапа.Код = "ОпределитьВерсиюКонфигурации" Тогда
		ДанныеЭтапа.НачальныеДанные = Метаданные.Версия;
		УстановитьПризнакАктивностиЭтапа(ДанныеЭтапа, НастройкиПодключения);
	КонецЕсли;	
	
	Если ДанныеЭтапа.Код = "ОпределитьУстановленЛиПредпочитаемыйПоставщик" Тогда
		
		Если ЗначениеЗаполнено(Константы.ПредпочитатьПоставщикаСУЗ.Получить()) Тогда
			ДанныеЭтапа.НачальныеДанные = "true";
		Иначе
			ДанныеЭтапа.НачальныеДанные = "false";
		КонецЕсли;
		
		УстановитьПризнакАктивностиЭтапа(ДанныеЭтапа, НастройкиПодключения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершитьЭтап(ДанныеЭтапа, Параметры, НастройкиПодключения)
	
	// Делаем проверки
	
	Если ДанныеЭтапа.Завершен Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем корректность выполнения этапа каждого типа
	
	Если ДанныеЭтапа.Код = "СоздатьВопрос" Тогда
		
		ДанныеЭтапа.ИтоговыеДанные = КоличествоЭлементовСправочника("ВопросыСУЗ");
		
		СозданноеКоличествоВопросов = Число(ДанныеЭтапа.ИтоговыеДанные) - Число(ДанныеЭтапа.НачальныеДанные);
		УстановитьЗначениеПараметра(Параметры, "СозданноеКоличествоВопросов", СозданноеКоличествоВопросов);
		
		ТребуемоеКоличествоВопросов = Число(ЗначениеПараметра(Параметры, "КоличествоВопросовДляСоздания"));
		
		Если СозданноеКоличествоВопросов = ТребуемоеКоличествоВопросов Тогда 
			ДанныеЭтапа.КодКомментария = "Верно";
			УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, 100);
		Иначе
			ДанныеЭтапа.КодКомментария = "ДобавленоВопросовОшибка";
			УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, 0);
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ДанныеЭтапа.Код = "СоздатьТест" Тогда
		
		ДанныеЭтапа.ИтоговыеДанные = КоличествоЭлементовСправочника("ПодборкиСУЗ", Новый Структура("ЭтоТест", Истина));
		
		СозданноеКоличествоТестов = Число(ДанныеЭтапа.ИтоговыеДанные) - Число(ДанныеЭтапа.НачальныеДанные); 
		УстановитьЗначениеПараметра(Параметры, "СозданноеКоличествоТестов", СозданноеКоличествоТестов);
		
		ТребуемоеКоличествоТестов = Число(ЗначениеПараметра(Параметры, "КоличествоТестовДляСоздания"));
		
		Если СозданноеКоличествоТестов = ТребуемоеКоличествоТестов Тогда 
			УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, 100);
			ДанныеЭтапа.КодКомментария = "Верно";
		Иначе
			УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, 0);
			ДанныеЭтапа.КодКомментария = "ДобавленоТестовОшибка";
		КонецЕсли;
		
	КонецЕсли;		
	
	Если ДанныеЭтапа.Код = "ОпределитьКоличествоПросмотровЭлектронногоРесурса" Тогда
		
		ДатаАнализа = ЗначениеПараметра(Параметры, "ДатаПросмотраЭлектронногоРесурса");
		ЭлектронныйРесурс = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеЭтапа.НачальныеДанные));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Период КАК Период,
			|	1 КАК Попытка
			|ИЗ
			|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
			|ГДЕ
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Период МЕЖДУ &НачалоДня И &КонецДня
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
		
		Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
		Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ДатаАнализа));
		Запрос.УстановитьПараметр("КонецДня", КонецДня(ДатаАнализа));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		КоличествоПросмотров = РезультатЗапроса.Выгрузить().Количество();
		
		Если КоличествоПросмотров = СтрокаВЧисло(ДанныеЭтапа.ОтветПользователя) Тогда
			УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, 100);
			ДанныеЭтапа.КодКомментария = "Верно";
		Иначе
			УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, 0);
			ДанныеЭтапа.КодКомментария = "Ошибка";
		КонецЕсли;
			
	КонецЕсли;		
	
	Если ДанныеЭтапа.Код = "ОпределитьДеньНаибольшейАктивностиВКурсеЗаЭтотГод" Тогда
		
		ДатаПросмотраЭлектронногоРесурса = ЗначениеПараметра(Параметры, "ДатаПросмотраЭлектронногоРесурса");
		
		Если ДатаПросмотраЭлектронногоРесурса = СтрокаВДату(ДанныеЭтапа.ОтветПользователя) Тогда
			УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, 100);
			ДанныеЭтапа.КодКомментария = "Верно";
		Иначе
			УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, 0);
			ДанныеЭтапа.КодКомментария = "Ошибка";
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ДанныеЭтапа.Код = "ОпределитьВерсиюКонфигурации" Тогда
		
		Если ДанныеЭтапа.НачальныеДанные = СокрЛП(ДанныеЭтапа.ОтветПользователя) Тогда
			УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, 100);
			ДанныеЭтапа.КодКомментария = "Верно";
		Иначе
			УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, 0);
			ДанныеЭтапа.КодКомментария = "Ошибка";
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ДанныеЭтапа.Код = "ОпределитьУстановленЛиПредпочитаемыйПоставщик" Тогда
		
		Если СтрокаВБулево(ДанныеЭтапа.НачальныеДанные) = СтрокаВБулево(ДанныеЭтапа.ОтветПользователя) Тогда
			УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, 100);
			ДанныеЭтапа.КодКомментария = "Верно";
		Иначе
			УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, 0);
			ДанныеЭтапа.КодКомментария = "Ошибка";
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПризнакАктивностиЭтапа(ДанныеЭтапа, НастройкиПодключения)
	
	Если ДанныеЭтапа.Активный Тогда
		Возврат;
	КонецЕсли;		
	
	ДанныеЭтапа.Активный = Истина;
	ДанныеЭтапа.ДатаНачала = ТекущаяДатаСеанса();
	ДанныеЭтапа.ВебСсылка = НавигационнаяСсылкаНаБазу(НастройкиПодключения, "#e1cib/navigationpoint/desktop");
	
КонецПроцедуры

Процедура УстановитьПризнакЗавершенияЭтапа(ДанныеЭтапа, Результат=0)
	
	Если ДанныеЭтапа.Завершен Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЭтапа.Завершен = Истина;
	ДанныеЭтапа.ДатаОкончания = ТекущаяДатаСеанса();
	ДанныеЭтапа.Результат = Результат;
	
КонецПроцедуры

Процедура УстановитьЗначениеПараметра(Параметры, Знач Имя, Знач Значение)
	
	Параметр = Параметры.Найти(Имя, "Код"); 
	
	Если Параметр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметр.ЗаполняетсяПрограммой Тогда
		Возврат;	
	КонецЕсли;
	
	Параметр.Значение = Значение;
		
КонецПроцедуры

Функция ЗначениеПараметра(Параметры, Имя)
	
	Параметр = Параметры.Найти(Имя, "Код"); 
	
	Если Параметр = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Параметр.Значение;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция КоличествоЭлементовСправочника(Знач ИмяСправочника, Знач Отбор=Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО("+ИмяСправочника+".Ссылка) КАК Количество
		|ИЗ
		|	Справочник."+ИмяСправочника+" КАК "+ИмяСправочника+"
		|ГДЕ
		|	"+ИмяСправочника+".ПометкаУдаления = ЛОЖЬ
		|	И "+ИмяСправочника+".ЭтоГруппа = ЛОЖЬ";
		
	Если Отбор <> Неопределено Тогда
		
		Для каждого Элемент Из Отбор Цикл
		
			Запрос.Текст = Запрос.Текст + " И " + ИмяСправочника + "." + Элемент.Ключ + " = &" + Элемент.Ключ;
			
			Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат 0;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Количество;		
		
	КонецЕсли;	
	
КонецФункции

Функция ВыборкаЭлементовСправочника(Знач ИмяСправочника, Знач Отбор=Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СправочникСУЗ.Ссылка,
		|	СправочникСУЗ.Наименование
		|ИЗ
		|	Справочник."+ИмяСправочника+" КАК СправочникСУЗ
		|ГДЕ
		|	СправочникСУЗ.ЭтоГруппа = ЛОЖЬ
		|	И СправочникСУЗ.ПометкаУдаления = ЛОЖЬ";
		
	Если Отбор <> Неопределено Тогда
		
		Для каждого Элемент Из Отбор Цикл
		
			Запрос.Текст = Запрос.Текст + " И СправочникСУЗ." + Элемент.Ключ + " = &" + Элемент.Ключ;
			
			Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СлучайныйЭлементСправочника(Знач ИмяСправочника, Знач Отбор=Неопределено)
	
	ТаблицаЭлементов = ВыборкаЭлементовСправочника(ИмяСправочника, Отбор).Выгрузить();

	КоличествоЭлементов = ТаблицаЭлементов.Количество();

	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, КоличествоЭлементов-1);		

	Возврат ТаблицаЭлементов.Получить(СлучайноеЧисло);
	
КонецФункции

Функция СтрокаВЧисло(Значение)
	
	Попытка
		Возврат Число(Значение);
	Исключение
		Возврат 0;
	КонецПопытки;
	
КонецФункции

Функция СтрокаВДату(Значение) 
	
	ДатаМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Значение, ".", Истина, Истина);
	
	Если ДатаМассив.Количество() < 3 Тогда
		Возврат Дата("00010101");
	Иначе
		Возврат Дата(ДатаМассив[2]+ДатаМассив[1]+ДатаМассив[0]);
	КонецЕсли;
		
КонецФункции

Функция СтрокаВБулево(Значение)
	
	Если Значение = "1"
		ИЛИ НРег(Значение) = "да"
		ИЛИ НРег(Значение) = "истина"
		ИЛИ НРег(Значение) = "true" Тогда
		
		Возврат Истина;
		
	КонецЕсли;	
	
	Если Значение = "0"
		ИЛИ НРег(Значение) = "нет"
		ИЛИ НРег(Значение) = "ложь"
		ИЛИ НРег(Значение) = "false" Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Функция НавигационнаяСсылкаНаБазу(НастройкиПодключения, ПутьКЭлементу)
	
	Если НастройкиПодключения = Метаданные.Имя Тогда
		Ссылка = Неопределено;
	Иначе
		Если НастройкиПодключения.СпособПодключения = Перечисления.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ.ВебСервер Тогда
			Ссылка = ПолучитьНавигационнуюСсылкуИнформационнойБазы() + ПутьКЭлементу;	
		КонецЕсли;
		
		Если НастройкиПодключения.СпособПодключения = Перечисления.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ.Сервер Тогда
			Ссылка = "e1c://server/" + НастройкиПодключения.ИмяСервераИнформационнойБазы + "/" + НастройкиПодключения.ИмяИнформационнойБазыНаСервере + ПутьКЭлементу;
		КонецЕсли;
		
		Если НастройкиПодключения.СпособПодключения = Перечисления.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ.Файл Тогда
			
			Если Сред(НастройкиПодключения.КаталогИнформационнойБазы, 1, 2) = "\\" Тогда
				
				Ссылка = "e1c://file/" + НастройкиПодключения.КаталогИнформационнойБазы + ПутьКЭлементу;
				
			Иначе
				
				СимволТома = Сред(НастройкиПодключения.КаталогИнформационнойБазы, 1, 1);
				
				Ссылка = "e1c://filev/" + СимволТома + "/" + Сред(НастройкиПодключения.КаталогИнформационнойБазы, 4) + ПутьКЭлементу;  
				
			КонецЕсли;
			
			Ссылка = СтрЗаменить(Ссылка, "\", "/");
			
		КонецЕсли;		
	КонецЕсли;
	
	
	Возврат Ссылка;
	
КонецФункции

#КонецЕсли
